In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:

%env DATABASE_URL=postgresql://retail_user:Baua%401865@localhost:5432/retail_db

env: DATABASE_URL=postgresql://retail_user:Baua%401865@localhost:5432/retail_db

In [10]:
import pandas as pd

In [11]:
def get_schemas(schemas,table,sorting_key='column_position'):
    columns=schemas[table]
    sorted_column=sorted(columns,key=lambda col:col[sorting_key])
    return [col['column_name'] for col in sorted_column]

In [12]:
import json

In [13]:
schemas=json.load(open('data/retail_db/schemas.json'))

In [14]:
columns=get_schemas(schemas,'orders')

In [15]:
df=pd.read_csv(
    'data/retail_db/orders/part-00000',
    names=columns
)

In [16]:
connect_url='postgresql://retail_user:Baua%401865@localhost:5432/retail_db'

In [17]:
df.to_sql('orders_new', 
connect_url,
if_exists='replace',
index=False,

)

883

In [18]:
pd.read_sql('orders_new',
connect_url,

)

       order_id             order_date  order_customer_id     order_status
0             1  2013-07-25 00:00:00.0              11599           CLOSED
1             2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0              12111         COMPLETE
3             4  2013-07-25 00:00:00.0               8827           CLOSED
4             5  2013-07-25 00:00:00.0              11318         COMPLETE
...         ...                    ...                ...              ...
68878     68879  2014-07-09 00:00:00.0                778         COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0               2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0              10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0               5533         COMPLETE

[68883 rows x 4 columns]

In [19]:
df_chunks=pd.read_csv(
    'data/retail_db/orders/part-00000',
    names=columns,
    chunksize=10000
)

In [20]:
chunk_list=list(df_chunks)

In [21]:
chunk_list[0]

      order_id             order_date  order_customer_id     order_status
0            1  2013-07-25 00:00:00.0              11599           CLOSED
1            2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2            3  2013-07-25 00:00:00.0              12111         COMPLETE
3            4  2013-07-25 00:00:00.0               8827           CLOSED
4            5  2013-07-25 00:00:00.0              11318         COMPLETE
...        ...                    ...                ...              ...
9995      9996  2013-09-25 00:00:00.0              11839          PENDING
9996      9997  2013-09-25 00:00:00.0               3471  PENDING_PAYMENT
9997      9998  2013-09-25 00:00:00.0               9419          PENDING
9998      9999  2013-09-25 00:00:00.0               1185           CLOSED
9999     10000  2013-09-25 00:00:00.0               8983       PROCESSING

[10000 rows x 4 columns]

In [22]:
chunk_list[1]

       order_id             order_date  order_customer_id     order_status
10000     10001  2013-09-25 00:00:00.0                316  PENDING_PAYMENT
10001     10002  2013-09-25 00:00:00.0               1530         COMPLETE
10002     10003  2013-09-25 00:00:00.0               8099         COMPLETE
10003     10004  2013-09-25 00:00:00.0               7768           CLOSED
10004     10005  2013-09-25 00:00:00.0                541         COMPLETE
...         ...                    ...                ...              ...
19995     19996  2013-11-25 00:00:00.0              11161  PENDING_PAYMENT
19996     19997  2013-11-25 00:00:00.0               1920         COMPLETE
19997     19998  2013-11-25 00:00:00.0              11672       PROCESSING
19998     19999  2013-11-25 00:00:00.0              10014         COMPLETE
19999     20000  2013-11-25 00:00:00.0                974  PENDING_PAYMENT

[10000 rows x 4 columns]

In [23]:
df_chunks=pd.read_csv(
    'data/retail_db/orders/part-00000',
    names=columns,
    chunksize=10000
)

In [24]:
%%sql

TRUNCATE TABLE orders_new;

Done.

[]

In [25]:
for idx, df in enumerate(df_chunks):
    print(f'size of chunk {idx} is {df.shape}')
    df.to_sql('orders_new', 
        connect_url,
        if_exists='append',
        index=False,
    )

size of chunk 0 is (10000, 4)
size of chunk 1 is (10000, 4)
size of chunk 2 is (10000, 4)
size of chunk 3 is (10000, 4)
size of chunk 4 is (10000, 4)
size of chunk 5 is (10000, 4)
size of chunk 6 is (8883, 4)

In [26]:
pd.read_sql('orders_new',connect_url)

       order_id             order_date  order_customer_id     order_status
0             1  2013-07-25 00:00:00.0              11599           CLOSED
1             2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0              12111         COMPLETE
3             4  2013-07-25 00:00:00.0               8827           CLOSED
4             5  2013-07-25 00:00:00.0              11318         COMPLETE
...         ...                    ...                ...              ...
68878     68879  2014-07-09 00:00:00.0                778         COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0               2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0              10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0               5533         COMPLETE

[68883 rows x 4 columns]

In [27]:
%%sql

TRUNCATE TABLE departments;

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [28]:
%%sql
TRUNCATE TABLE categories;

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [29]:
%%sql
TRUNCATE TABLE order_items;

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [30]:
%%sql
TRUNCATE TABLE orders CASCADE;

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [36]:
%%sql
TRUNCATE TABLE customers CASCADE;
TRUNCATE TABLE products;

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.
Done.

[]

In [32]:
%%sql
select * from orders;

 * postgresql://retail_user:***@localhost:5432/retail_db
0 rows affected.

[]